app/controllers/blogs_controller.rb

INSERT INTO "blogs" ("name", "title", "content", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "First Blog"], ["title", "First"], ["content", "Hi my name is navin!!"], ["user_id", 3], ["created_at", "2023-04-29 05:58:08.788522"], ["updated_at", "2023-04-29 05:58:08.788522"]]
---
  def create
    @blog = Blog.new(blog_params)

    respond_to do |format|
      if @blog.save

UPDATE "blogs" SET "content" = ?, "updated_at" = ? WHERE "blogs"."id" = ?  [["content", "I am a ROR developer"], ["updated_at", "2023-04-29 05:59:48.457886"], ["id", 2]]
---
  def update
    respond_to do |format|
      if @blog.update(blog_params)