app/controllers/registrations_controller.rb

INSERT INTO "users" ("email", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["email", "nitesh.krjs@gmail.com"], ["password_digest", "[FILTERED]"], ["created_at", "2023-04-28 18:56:11.504111"], ["updated_at", "2023-04-28 18:56:11.504111"]]
---
    def create
      @user = User.new(user_params)
      respond_to do |format|
        if @user.save