app/controllers/concerns/authentication.rb

    def authenticate
      if session[:user_id].present?
        # finds user with session data and stores it if present
        Current.user = User.find_by(id: session[:user_id]) if session[:user_id]
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]